cf_billing/DataProcessors/энргРаботаСДолжниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргРаботаСДолжниками</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задолженность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСхемыПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргСхемыПИДОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСхемыПИДОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСхемыПИД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияДебитора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестКатегорииДебитора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Юридическая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаАбонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчетыПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоМесяцам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкиНачисленияПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкиНачисленияПени</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГлубинаОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайнийСрокОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяГлубинаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьНаТекущуюДату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/DataProcessors/энргРаботаСДолжниками/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьЗапрос(Отборы = Неопределено, ИсключитьЗадачи = Ложь) Экспорт 
	Перем ТекДата, Организация, Район, Абонент, Задолженность,КоличествоДнейПросрочки,МКД,Услуга,Ответственный,Этап, Поставщик, ГруппаАбонента, КоличествоНеоплаченныхПериодов, УчитыватьСуммуНормативногоРасхода, Улица, НаселенныйПункт;
	
	Если Отборы = Неопределено Тогда
		Отборы = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапроса();
	// Установка параметров в зависимости от отборов
	Если Не Отборы.Свойство("ТекДата", ТекДата) Или Не ЗначениеЗаполнено(ТекДата) Тогда
		ТекДата = ТекущаяДата();
	КонецЕсли;	
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	Запрос.УстановитьПараметр("ИсключитьЗадачи", ИсключитьЗадачи);
	
	Если Отборы.Свойство("Организация", Организация) И ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргЗадачаПИД.Организация = &Организация", "Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", 				 "Истина");
	КонецЕсли;
	
	Если Отборы.Свойство("Район", Район) И ЗначениеЗаполнено(Район) Тогда
		Запрос.УстановитьПараметр("Район", Район);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргЗадачаПИД.Район = &Район", "Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Район = &Район", 				 "Истина");
	КонецЕсли;
	
	Если Отборы.Свойство("МКД", МКД) И ЗначениеЗаполнено(МКД) Тогда
		Запрос.УстановитьПараметр("МКД", МКД);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргЗадачаПИД.МКД = &МКД", 			"Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&МКД = энргКлючиПомещений.Строение", 	"Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "МКД = &МКД",				 			"Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргКлючиПомещений.Строение = &МКД",	"Истина");
	КонецЕсли;

	Если Отборы.Свойство("Абонент", Абонент) И ЗначениеЗаполнено(Абонент) Тогда
		Запрос.УстановитьПараметр("Абонент", Абонент);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргЗадачаПИД.Абонент = &Абонент", "Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Абонент = &Абонент", 				 "Истина");
	КонецЕсли;

	Если Отборы.Свойство("Задолженность", Задолженность) И ЗначениеЗаполнено(Задолженность) Тогда
		Запрос.УстановитьПараметр("Задолженность", Задолженность);
	Иначе
		Запрос.УстановитьПараметр("Задолженность", 0);
	КонецЕсли;

	Если Отборы.Свойство("КоличествоДнейПросрочки", КоличествоДнейПросрочки) И ЗначениеЗаполнено(КоличествоДнейПросрочки) Тогда
		Запрос.УстановитьПараметр("КоличествоДнейПросрочки", КоличествоДнейПросрочки);
	Иначе
		Запрос.УстановитьПараметр("КоличествоДнейПросрочки", 0);
	КонецЕсли;
	
	Если Отборы.Свойство("Услуга", Услуга) И ЗначениеЗаполнено(Услуга) Тогда
		Запрос.УстановитьПараметр("Услуга", Услуга);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Услуга = &Услуга", "Истина");
	КонецЕсли;
	
	Если Отборы.Свойство("Ответственный", Ответственный) И ЗначениеЗаполнено(Ответственный) Тогда
		Запрос.УстановитьПараметр("Ответственный", Ответственный);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргЗадачаПИД.Исполнитель = &Ответственный", 			  "Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_ЭтапыИОтветственные.Ответственный = &Ответственный", "Истина");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕСТЬNULL(ВТ_ЭтапыИОтветственные.Ответственный, ВТ_Остатки.Ответственный) = &Ответственный", "Истина");	
	КонецЕсли;

	Если Отборы.Свойство("Этап", Этап) И ЗначениеЗаполнено(Этап) Тогда
		Запрос.УстановитьПараметр("Этап", Этап);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргЗадачаПИД.Этап = &Этап", 			"Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_ЭтапыИОтветственные.Этап = &Этап", "Истина");
	КонецЕсли;

	Если Отборы.Свойство("Поставщик", Поставщик) И ЗначениеЗаполнено(Поставщик) Тогда
		Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Поставщик = &Поставщик", " Истина");
	КонецЕсли;	

	Если Отборы.Свойство("ГруппаАбонента", ГруппаАбонента) И ЗначениеЗаполнено(ГруппаАбонента) Тогда
		Запрос.УстановитьПараметр("ГруппаАбонента", ГруппаАбонента);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргЗадачаПИД.Абонент В ИЕРАРХИИ(&ГруппаАбонента)", " Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Абонент В ИЕРАРХИИ (&ГруппаАбонента)",			  " Истина");
	КонецЕсли;
	
	Если Отборы.Свойство("КоличествоНеоплаченныхПериодов", КоличествоНеоплаченныхПериодов) И ЗначениеЗаполнено(КоличествоНеоплаченныхПериодов) Тогда
		Запрос.УстановитьПараметр("КоличествоНеоплаченныхПериодов", КоличествоНеоплаченныхПериодов);
	Иначе
		Запрос.УстановитьПараметр("КоличествоНеоплаченныхПериодов", 0);
	КонецЕсли;
	
	Если Отборы.Свойство("УчитыватьСуммуНормативногоРасхода", УчитыватьСуммуНормативногоРасхода) Тогда
		Запрос.УстановитьПараметр("УчитыватьСуммуНормативногоРасхода", УчитыватьСуммуНормативногоРасхода);
	КонецЕсли;
	
	Если Отборы.Свойство("НаселенныйПункт", НаселенныйПункт) И ЗначениеЗаполнено(НаселенныйПункт)
		Или Отборы.Свойство("Улица", Улица) И ЗначениеЗаполнено(Улица) Тогда
		
		Запрос.Текст 	= СтрЗаменить(Запрос.Текст, "&ОтборАдрес", ПолучитьТекстПроверкаНаАдрес(Запрос, НаселенныйПункт, Улица));		
	Иначе 
		Запрос.Текст 	= СтрЗаменить(Запрос.Текст, "&ОтборАдрес", "Истина");		
	КонецЕсли;
	
		
	Возврат Запрос;
КонецФункции
 
Функция ПолучитьСписокОтборовСхемы(Схема) Экспорт

	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСхемыПИДОрганизацийСрезПоследних.Организация КАК Организация,
		|	энргСхемыПИДОрганизацийСрезПоследних.Район КАК Район,
		|	энргСхемыПИДОрганизацийСрезПоследних.МКД КАК МКД,
		|	энргСхемыПИДОрганизацийСрезПоследних.ГруппаАбонента КАК ГруппаАбонента,
		|	энргСхемыПИДОрганизацийСрезПоследних.Абонент КАК Абонент,
		|	энргСхемыПИДОрганизацийСрезПоследних.Услуга КАК Услуга
		|ИЗ
		|	РегистрСведений.энргСхемыПИДОрганизаций.СрезПоследних(&ТекДата, ) КАК энргСхемыПИДОрганизацийСрезПоследних
		|ГДЕ
		|	энргСхемыПИДОрганизацийСрезПоследних.Схема = &Схема";
	
	Запрос.УстановитьПараметр("Схема", Схема);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	ПарамОтбора = "";
	Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ПарамОтбора = ?(ПустаяСтрока(ПарамОтбора), "", ПарамОтбора + ", ") + Колонка.Имя;
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ВариантОтбора = Новый Структура(ПарамОтбора);
		ЗаполнитьЗначенияСвойств(ВариантОтбора, Выборка);
		
		Результат.Добавить(ВариантОтбора);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции 

#Область РаботаСФормированиемОтчета

Функция СформироватьКвитанции(ПериодНачисления, Организация, Район, ДополнительныеПараметры = Неопределено) Экспорт
	
	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб 			= Истина;
	
	ИмяМакета 								= Документы.рксЕдиныйПлатежныйДокумент.ПолучитьИмяМакета(ПериодНачисления);

	Если ИмяМакета = "ПФ_MXL_КвитанцияЕПДОт01012020" Тогда
		Результат = Документы.рксЕдиныйПлатежныйДокумент.ПолучитьДокументыЕПДДляОтчетаОт01012020(ПериодНачисления, Организация, Район, ДополнительныеПараметры);
		Документы.рксЕдиныйПлатежныйДокумент.ЗаполнитьМакетЕПДОт01012020(Результат, ТабличныйДокумент, ИмяМакета, ДополнительныеПараметры);
	КонецЕсли;

	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСОтборомПоАдресу

Функция ПолучитьТекстПроверкаНаАдрес(Запрос, НаселенныйПункт, Улица)
	Шаблон = "ВЫБОР
	|			КОГДА энргАбонентыКонтактнаяИнформация.Тип = Значение(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И энргАбонентыКонтактнаяИнформация.Вид = Значение(Справочник.ВидыКонтактнойИнформации.АдресОбъекта)
	|				ТОГДА энргАбоненты.КонтактнаяИнформация.Представление ПОДОБНО &Представление
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";
	
	
	ОбщийТекст = "";
	
	Если ЗначениеЗаполнено(НаселенныйПункт) Тогда
		ДополнитьОбщийТекст(ОбщийТекст, Шаблон, "&НаселенныйПункт");
		Запрос.УстановитьПараметр("НаселенныйПункт", "%" + НаселенныйПункт + "%");		
	КонецЕсли;
	Если ЗначениеЗаполнено(Улица) Тогда
		ДополнитьОбщийТекст(ОбщийТекст, Шаблон, "&Улица");
		Запрос.УстановитьПараметр("Улица", "%" + Улица + "%");		
	КонецЕсли;
		
	Возврат ?(ОбщийТекст = "", "", "  " + ОбщийТекст );
	
КонецФункции

Процедура ДополнитьОбщийТекст(ОбщийТекст, Шаблон, ПодстрокаЗамены)
	ОбщийТекст = ОбщийТекст + ?(ОбщийТекст = "", "", " ИЛИ ") + СтрЗаменить(Шаблон, "&Представление", ПодстрокаЗамены);
КонецПроцедуры

#КонецОбласти

Функция ТекстЗапроса() Экспорт 

	Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	энргЗадачаПИД.Абонент КАК Абонент,
		|	энргЗадачаПИД.Этап КАК Этап,
		|	энргЗадачаПИД.ДатаСледЭтапа КАК ДатаСледЭтапа,
		|	энргЗадачаПИД.Организация КАК Организация,
		|	энргЗадачаПИД.Исполнитель КАК Ответственный,
		|	энргЗадачаПИД.Ссылка КАК Задача
		|ПОМЕСТИТЬ ВТ_ЭтапыИОтветственные
		|ИЗ
		|	Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|ГДЕ
		|	НЕ энргЗадачаПИД.Выполнена
		|	И энргЗадачаПИД.Абонент <> ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
		|	И энргЗадачаПИД.Организация = &Организация
		|	И энргЗадачаПИД.Этап = &Этап
		|	И НЕ энргЗадачаПИД.ПометкаУдаления
		|	И энргЗадачаПИД.Район = &Район
		|	И энргЗадачаПИД.МКД = &МКД
		|	И энргЗадачаПИД.Абонент = &Абонент
		|	И энргЗадачаПИД.Исполнитель = &Ответственный
		|	И энргЗадачаПИД.Абонент В ИЕРАРХИИ(&ГруппаАбонента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЭтапыИОтветственные.Абонент КАК Абонент,
		|	ВТ_ЭтапыИОтветственные.Этап КАК Этап,
		|	ВТ_ЭтапыИОтветственные.ДатаСледЭтапа КАК ДатаСледЭтапа,
		|	ВТ_ЭтапыИОтветственные.Организация КАК Организация,
		|	ВТ_ЭтапыИОтветственные.Ответственный КАК Ответственный,
		|	ВТ_ЭтапыИОтветственные.Задача КАК Задача,
		|	энргЗадачаПИДЗадолженность.Услуга КАК Услуга,
		|	энргЗадачаПИДЗадолженность.ПериодНачисления КАК ПериодНачисления
		|ПОМЕСТИТЬ ВТ_ЗадачиПоЗадолженности
		|ИЗ
		|	ВТ_ЭтапыИОтветственные КАК ВТ_ЭтапыИОтветственные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД.Задолженность КАК энргЗадачаПИДЗадолженность
		|		ПО ВТ_ЭтапыИОтветственные.Задача = энргЗадачаПИДЗадолженность.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	энргВзаиморасчетыПоМесяцамОстатки.Организация КАК Организация,
		|	энргВзаиморасчетыПоМесяцамОстатки.Район КАК Район,
		|	энргВзаиморасчетыПоМесяцамОстатки.Абонент КАК Абонент,
		|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления КАК ПериодНачисления,
		|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток КАК СуммаОстаток,
		|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
		|	МАКСИМУМ(энргНастройкиНачисленияПени.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_НепогашеныеНачисления
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
		|			&ТекДата,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Услуга = &Услуга
		|				И Абонент = &Абонент
		|				И МКД = &МКД
		|				И Поставщик = &Поставщик
		|				И Абонент В ИЕРАРХИИ (&ГруппаАбонента)) КАК энргВзаиморасчетыПоМесяцамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкиНачисленияПени КАК энргНастройкиНачисленияПени
		|		ПО энргВзаиморасчетыПоМесяцамОстатки.Организация = энргНастройкиНачисленияПени.Организация
		|			И энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления >= энргНастройкиНачисленияПени.Период
		|			И энргВзаиморасчетыПоМесяцамОстатки.Район = энргНастройкиНачисленияПени.Район
		|ГДЕ
		|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток > 0
		|	И энргВзаиморасчетыПоМесяцамОстатки.Услуга <> ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВзаиморасчетыПоМесяцамОстатки.Организация,
		|	энргВзаиморасчетыПоМесяцамОстатки.Район,
		|	энргВзаиморасчетыПоМесяцамОстатки.Абонент,
		|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления,
		|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток,
		|	энргВзаиморасчетыПоМесяцамОстатки.Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_НепогашеныеНачисления.Организация КАК Организация,
		|	ВТ_НепогашеныеНачисления.Район КАК Район,
		|	ВТ_НепогашеныеНачисления.Абонент КАК Абонент,
		|	ВТ_НепогашеныеНачисления.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_НепогашеныеНачисления.СуммаОстаток КАК СуммаОстаток,
		|	ВТ_НепогашеныеНачисления.Услуга КАК Услуга,
		|	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ВТ_НепогашеныеНачисления.ПериодНачисления, МЕСЯЦ), СЕКУНДА, 3600 * 24 * ЕСТЬNULL(энргНастройкиНачисленияПени.КрайнийСрокОплаты - 1, 0)) КАК Граница
		|ПОМЕСТИТЬ ВТ_ЗадолженностьСГраницей
		|ИЗ
		|	ВТ_НепогашеныеНачисления КАК ВТ_НепогашеныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкиНачисленияПени КАК энргНастройкиНачисленияПени
		|		ПО ВТ_НепогашеныеНачисления.Организация = энргНастройкиНачисленияПени.Организация
		|			И ВТ_НепогашеныеНачисления.Район = энргНастройкиНачисленияПени.Район
		|			И ВТ_НепогашеныеНачисления.Период = энргНастройкиНачисленияПени.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗадачиПоЗадолженности КАК ВТ_ЗадачиПоЗадолженности
		|		ПО ВТ_НепогашеныеНачисления.Организация = ВТ_ЗадачиПоЗадолженности.Организация
		|			И ВТ_НепогашеныеНачисления.Абонент = ВТ_ЗадачиПоЗадолженности.Абонент
		|			И ВТ_НепогашеныеНачисления.Услуга = ВТ_ЗадачиПоЗадолженности.Услуга
		|			И ВТ_НепогашеныеНачисления.ПериодНачисления = ВТ_ЗадачиПоЗадолженности.ПериодНачисления
		|ГДЕ
		|	(ВТ_ЗадачиПоЗадолженности.Задача ЕСТЬ NULL
		|			ИЛИ НЕ &ИсключитьЗадачи)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗадолженностьСГраницей.Организация КАК Организация,
		|	ВТ_ЗадолженностьСГраницей.Район КАК Район,
		|	ВТ_ЗадолженностьСГраницей.Абонент КАК Абонент,
		|	СУММА(ВТ_ЗадолженностьСГраницей.СуммаОстаток) КАК СуммаОстаток,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ЗадолженностьСГраницей.ПериодНачисления) КАК ПериодНачисления
		|ПОМЕСТИТЬ ВТ_ОтборПоСуммеЗадолженности
		|ИЗ
		|	ВТ_ЗадолженностьСГраницей КАК ВТ_ЗадолженностьСГраницей
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗадолженностьСГраницей.Организация,
		|	ВТ_ЗадолженностьСГраницей.Район,
		|	ВТ_ЗадолженностьСГраницей.Абонент
		|
		|ИМЕЮЩИЕ
		|	(НЕ &Задолженность > 0
		|		ИЛИ СУММА(ВТ_ЗадолженностьСГраницей.СуммаОстаток) >= &Задолженность) И
		|	(НЕ &КоличествоНеоплаченныхПериодов > 0
		|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ЗадолженностьСГраницей.ПериодНачисления) >= &КоличествоНеоплаченныхПериодов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗадолженностьСГраницей.Организация КАК Организация,
		|	ВТ_ЗадолженностьСГраницей.Район КАК Район,
		|	ВТ_ЗадолженностьСГраницей.Абонент КАК Абонент,
		|	ВТ_ЗадолженностьСГраницей.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ЗадолженностьСГраницей.СуммаОстаток КАК СуммаОстаток,
		|	ВТ_ЗадолженностьСГраницей.Услуга КАК Услуга,
		|	ВТ_ЗадолженностьСГраницей.Граница КАК Граница,
		|	РАЗНОСТЬДАТ(ВТ_ЗадолженностьСГраницей.Граница, &ТекДата, ДЕНЬ) КАК КоличествоДнейПросрочки
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	ВТ_ЗадолженностьСГраницей КАК ВТ_ЗадолженностьСГраницей
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтборПоСуммеЗадолженности КАК ВТ_ОтборПоСуммеЗадолженности
		|		ПО ВТ_ЗадолженностьСГраницей.Организация = ВТ_ОтборПоСуммеЗадолженности.Организация
		|			И ВТ_ЗадолженностьСГраницей.Район = ВТ_ОтборПоСуммеЗадолженности.Район
		|			И ВТ_ЗадолженностьСГраницей.Абонент = ВТ_ОтборПоСуммеЗадолженности.Абонент
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ ВТ_ОтборПоСуммеЗадолженности.Абонент ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			КОГДА &КоличествоДнейПросрочки = 0
		|					И &Задолженность = 0
		|					И &КоличествоНеоплаченныхПериодов = 0
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ &КоличествоДнейПросрочки <> 0
		|					И РАЗНОСТЬДАТ(ВТ_ЗадолженностьСГраницей.Граница, &ТекДата, ДЕНЬ) >= &КоличествоДнейПросрочки
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Остатки.Организация КАК Организация,
		|	ВТ_Остатки.Район КАК Район,
		|	ВТ_Остатки.Абонент КАК Абонент,
		|	СУММА(ВТ_Остатки.СуммаОстаток) КАК СуммаЗадолженности,
		|	ВТ_Остатки.Услуга КАК Услуга,
		|	ВТ_Остатки.ПериодНачисления КАК ПериодНачисления
		|ПОМЕСТИТЬ ВТ_Задолж
		|ИЗ
		|	ВТ_Остатки КАК ВТ_Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Остатки.Организация,
		|	ВТ_Остатки.Район,
		|	ВТ_Остатки.Абонент,
		|	ВТ_Остатки.Услуга,
		|	ВТ_Остатки.ПериодНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Задолж.Организация КАК Организация,
		|	ВТ_Задолж.Район КАК Район,
		|	ВТ_Задолж.Абонент КАК Абонент,
		|	ВТ_Остатки.СуммаОстаток КАК Задолженность,
		|	ВТ_ЭтапыИОтветственные.Этап КАК Этап,
		|	ВТ_ЭтапыИОтветственные.ДатаСледЭтапа КАК ДатаСледЭтапа,
		|	ВТ_ЭтапыИОтветственные.Ответственный КАК Ответственный,
		|	ВТ_ЭтапыИОтветственные.Задача КАК Задача,
		|	ВТ_Остатки.Услуга КАК Услуга,
		|	ВТ_Остатки.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_Остатки.КоличествоДнейПросрочки КАК КоличествоДнейПросрочки
		|ПОМЕСТИТЬ ВТ_Задолженность_1
		|ИЗ
		|	ВТ_Задолж КАК ВТ_Задолж
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗадачиПоЗадолженности КАК ВТ_ЭтапыИОтветственные
		|		ПО ВТ_Задолж.Организация = ВТ_ЭтапыИОтветственные.Организация
		|			И ВТ_Задолж.Абонент = ВТ_ЭтапыИОтветственные.Абонент
		|			И ВТ_Задолж.ПериодНачисления = ВТ_ЭтапыИОтветственные.ПериодНачисления
		|			И ВТ_Задолж.Услуга = ВТ_ЭтапыИОтветственные.Услуга
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО ВТ_Задолж.Организация = ВТ_Остатки.Организация
		|			И ВТ_Задолж.Район = ВТ_Остатки.Район
		|			И ВТ_Задолж.Абонент = ВТ_Остатки.Абонент
		|			И ВТ_Задолж.Услуга = ВТ_Остатки.Услуга
		|			И ВТ_Задолж.ПериодНачисления = ВТ_Остатки.ПериодНачисления
		|ГДЕ
		|	ВТ_ЭтапыИОтветственные.Этап = &Этап
		|	И ВТ_ЭтапыИОтветственные.Ответственный = &Ответственный
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЭтапыИОтветственные.ДатаСледЭтапа,
		|	ВТ_ЭтапыИОтветственные.Ответственный,
		|	ВТ_ЭтапыИОтветственные.Задача,
		|	ВТ_ЭтапыИОтветственные.Этап,
		|	ВТ_Задолж.Организация,
		|	ВТ_Задолж.Район,
		|	ВТ_Задолж.Абонент,
		|	ВТ_Остатки.Услуга,
		|	ВТ_Остатки.ПериодНачисления,
		|	ВТ_Остатки.СуммаОстаток,
		|	ВТ_Остатки.КоличествоДнейПросрочки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	энргАбоненты.ЛицевойСчет КАК ЛицевойСчет,
		|	ВТ_Задолженность_1.Абонент КАК Абонент,
		|	ВТ_Задолженность_1.Задолженность КАК Задолженность,
		|	ВТ_Задолженность_1.Этап КАК Этап,
		|	ВЫБОР
		|		КОГДА ВТ_Задолженность_1.ДатаСледЭтапа = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА NULL
		|		ИНАЧЕ ВЫРАЗИТЬ(РАЗНОСТЬДАТ(&ТекДата, ВТ_Задолженность_1.ДатаСледЭтапа, ДЕНЬ) КАК ЧИСЛО(5, 0))
		|	КОНЕЦ КАК КолДнейСледЭтапа,
		|	ВТ_Задолженность_1.Ответственный КАК Ответственный,
		|	ВТ_Задолженность_1.Задача КАК Задача,
		|	энргАбоненты.КлючПомещения.Строение КАК Дом,
		|	ВТ_Задолженность_1.КоличествоДнейПросрочки КАК КоличествоДнейПросрочки,
		|	энргАбоненты.КлючПомещения.Помещение КАК Квартира,
		|	ВТ_Задолженность_1.Услуга КАК Услуга,
		|	ВТ_Задолженность_1.Организация КАК Организация,
		|	ВТ_Задолженность_1.Район КАК Район,
		|	ВТ_Задолженность_1.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_Задолженность_1.Задача КАК КоличествоЗадач
		|ИЗ
		|	ВТ_Задолженность_1 КАК ВТ_Задолженность_1
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
		|		ПО ВТ_Задолженность_1.Абонент = энргАбоненты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
		|		ПО ВТ_Задолженность_1.Абонент = энргАбонентыКонтактнаяИнформация.Ссылка
		|			И (энргАбонентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъекта))
		|ГДЕ
		|	&ОтборАдрес
		|
		|УПОРЯДОЧИТЬ ПО
		|	Абонент,
		|	ПериодНачисления,
		|	Услуга
		|ИТОГИ
		|	МАКСИМУМ(ЛицевойСчет),
		|	СУММА(Задолженность),
		|	МАКСИМУМ(Этап),
		|	МАКСИМУМ(КолДнейСледЭтапа),
		|	МАКСИМУМ(Ответственный),
		|	МАКСИМУМ(Задача),
		|	МАКСИМУМ(Дом),
		|	МАКСИМУМ(КоличествоДнейПросрочки),
		|	МАКСИМУМ(Квартира),
		|	МАКСИМУМ(Организация),
		|	МАКСИМУМ(Район),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоЗадач)
		|ПО
		|	Абонент,
		|	ПериодНачисления
		|АВТОУПОРЯДОЧИВАНИЕ";

	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецЕсли
